src/cf/Catalogs/уатСценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСценарииПланирования</Name>
			<Comment>Сценарии планирования (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКраткосрочноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКраткосрочногоПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОперативноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьЗаказыНаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьРазнарядкиНаВыпускТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНомерПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатДетализацияПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПланированиеПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаполненияВесаОбъемаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОбъемовВПроцентах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеВДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыПоказателейПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатРазделыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРазделыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоПЛ</Name>
					<Comment>(не используется) Выработка ТС по путевым листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоМЛ</Name>
					<Comment>(не используется) Выработка ТС по маршрутным листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныеУслуги</Name>
					<Comment>Предоставленные услуги</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходы</Name>
					<Comment>Доходы и Расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемыПеревозок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтыИТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказыНаЖДПеревозки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Долгосрочный</Name>
					<Comment>Долгосрочный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краткосрочный</Name>
					<Comment>Краткосрочный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПолучателиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПолучателиУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатРазрезыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРазрезыПланирования</Name>
			<Comment>Разрезы планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Колонна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураТО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВариантыАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыАналитик</Name>
			<Comment>Варианты аналитик</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринадлежностьТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузоотправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузополучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодЕТСНГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодГНГ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатСценарииПланирования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда
		ОтображениеПериода = ?(Объект.ОтображатьНомерПериода, 1, 0);
		Если Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги")
			И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
			
			Объект.Валюта = ВалютаРеглУчета;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидПланирования = ПредопределенноеЗначение("Перечисление.уатВидыПланирования.Краткосрочный") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	ЗаполнитьСписокПоказателейПланирования();
	
	Для Каждого ТекСтрока Из Объект.РазрезыПоказателейПланирования Цикл
		НоваяСтрока = РазрезыПоказателейПланирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	УстановитьВидимость();
	УстановитьСписокВыбораПериодичностьКраткосрочногоПланирования();
	
	Если НЕ Объект.Ссылка.Пустая() 
		И Объект.ВидПланирования = ПредопределенноеЗначение("Перечисление.уатВидыПланирования.Краткосрочный") Тогда
		ПериодичностьДолгосрочногоПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВедущийСценарий, "Периодичность");
		УстановитьСписокВыбораПериодичностьПланирования(ПериодичностьДолгосрочногоПланирования);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОтображениеПериода = ?(Объект.ОтображатьНомерПериода, 1, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Объект.РазрезыПоказателейПланирования.Очистить();
	Для Каждого ТекСтрока Из ПоказателиПланирования Цикл
		СтрокиАналитик = РазрезыПоказателейПланирования.НайтиСтроки(Новый Структура("ПараметрВыработки", ТекСтрока.ПараметрВыработки));
		Если СтрокиАналитик.Количество() <> 0 Тогда
			Для Каждого ТекСтрока Из СтрокиАналитик Цикл
				НоваяСтрока = Объект.РазрезыПоказателейПланирования.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;
		Иначе
			НоваяСтрока = Объект.РазрезыПоказателейПланирования.Добавить();
			НоваяСтрока.ПараметрВыработки = ТекСтрока.ПараметрВыработки;
		Конецесли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборРазрезовПланированияСценария" Тогда
		ОбработкаВыбораРазрезовПланирования(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	РазрешитьРедактированиеТолькоВидимых = Ложь;
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект,, РазрешитьРедактированиеТолькоВидимых);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	УстановитьВидимость();

	Если Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Выработка") Тогда
		Объект.Валюта          = Неопределено;
		Объект.ПолучательУслуг = Неопределено;
	ИначеЕсли Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Аренда") Тогда
		Объект.Валюта          = Неопределено;
		Объект.ПолучательУслуг = Неопределено;
		Объект.РазрезыПланирования.Очистить();
		ПоказателиПланирования.Очистить();
	ИначеЕсли Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
		Объект.Валюта          = ВалютаРеглУчета;
		Объект.ПолучательУслуг = ПредопределенноеЗначение("Перечисление.уатПолучателиУслуг.Контрагент");
	ИначеЕсли Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.РемонтыИТО") Тогда
		Объект.Валюта          = ВалютаРеглУчета;
		Объект.ПолучательУслуг = Неопределено;
		Объект.РазрезыПланирования.Очистить();
		ПоказателиПланирования.Очистить();
		// pugili
	Иначе
		Объект.Валюта          = ВалютаРеглУчета;
		Объект.ПолучательУслуг = Неопределено;
	КонецЕсли;
	
	МассивУдаляемыхЗначений = Новый Массив();
	Для Каждого ТекСтрока Из Объект.РазрезыПланирования Цикл
		Если Объект.Раздел <> ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") 
			И (ТекСтрока.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Договор")
			ИЛИ ТекСтрока.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Услуга")) Тогда
			
			МассивУдаляемыхЗначений.Добавить(ТекСтрока);
		ИначеЕсли Объект.Раздел <> ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.РемонтыИТО")
			И (ТекСтрока.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураТО")) Тогда
			
			МассивУдаляемыхЗначений.Добавить(ТекСтрока);
		ИначеЕсли Объект.Раздел <> ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ДоходыРасходы")
			И (ТекСтрока.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураГруза")
			ИЛИ ТекСтрока.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Статья")) Тогда
			
			МассивУдаляемыхЗначений.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из МассивУдаляемыхЗначений Цикл
		Объект.РазрезыПланирования.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ВидПланированияПриИзменении(Элемент)
	Элементы.ВедущийСценарий.Видимость                             = Объект.ВидПланирования = ПредопределенноеЗначение("Перечисление.уатВидыПланирования.Краткосрочный");

	Если Объект.ВидПланирования = ПредопределенноеЗначение("Перечисление.уатВидыПланирования.Краткосрочный") Тогда
		Объект.Периодичность = Неопределено;
		
		ПериодичностьДолгосрочногоПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВедущийСценарий, "Периодичность");
		УстановитьСписокВыбораПериодичностьПланирования(ПериодичностьДолгосрочногоПланирования);
		
	Иначе
		
		УстановитьСписокВыбораПериодичностьПланирования(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьКраткосрочногоПланированияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	Объект.ПериодичностьКраткосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.ПустаяСсылка");
	
	УстановитьСписокВыбораПериодичностьКраткосрочногоПланирования();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКраткосрочноеПланированиеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	
	Объект.ОтображатьНомерПериода = ОтображениеПериода = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияВариантАналитикиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Очистить();
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазрезов = ПолучитьСписокРазрезов(ТекущиеДанные.РазрезПланирования);
	ДанныеВыбора   = СписокРазрезов;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияВариантАналитикиПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Очистить();
	Элементы.РазрезыПланированияВариантАналитикиПредставление.СписокВыбора.Добавить(ВыбранноеЗначение);
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ВариантАналитики = ВыбранноеЗначение;
	Если ТекущиеДанные.ВариантАналитики
		= ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПринадлежностьТС") Тогда
		ТекущиеДанные.ПланированиеПоГруппам = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РазрезыПланированияРазрезПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Очистить();
	ДанныеВыбора = ПолучитьСписокВыбораРазрезПланирования(Объект.Раздел);

КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияРазрезПланированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Очистить();
	Элементы.РазрезыПланированияРазрезПланирования.СписокВыбора.Добавить(ВыбранноеЗначение);
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РазрезПланирования = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПланированияРазрезыПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоказателиПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	мРазрезыПланирования = Новый Массив;
	СтрокиАналитик = РазрезыПоказателейПланирования.НайтиСтроки(Новый Структура("ПараметрВыработки", ТекущиеДанные.ПараметрВыработки));
	Для Каждого ТекСтрока Из СтрокиАналитик Цикл
		СтруктураЗаполнения = Новый Структура("РазрезПланирования, ВариантАналитики, ПланированиеПоГруппам");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ТекСтрока);
		мРазрезыПланирования.Добавить(СтруктураЗаполнения);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура("Раздел, РазрезыПланирования, ПараметрВыработки",
		Объект.Раздел, мРазрезыПланирования, ТекущиеДанные.ПараметрВыработки);
	ОткрытьФорму("Справочник.уатСценарииПланирования.Форма.ФормаВыбораРазрезовПланирования", ПараметрыОткрытия, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРазрезовПланирования(ДопПараметры)
	
	Если ТипЗнч(ДопПараметры.РазрезыПланирования) <> Тип("Массив") Тогда
		Возврат;
	Конецесли;
	
	ТекущиеДанные = Элементы.ПоказателиПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РазрезыПланирования = "";
	
	Сч = РазрезыПоказателейПланирования.Количество()-1;
	Пока Сч >= 0 Цикл
		Если РазрезыПоказателейПланирования[Сч].ПараметрВыработки = ДопПараметры.ПараметрВыработки Тогда
			РазрезыПоказателейПланирования.Удалить(Сч);
		КонецЕсли;
					
		Сч = Сч - 1;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДопПараметры.РазрезыПланирования Цикл
		НоваяСтрока = РазрезыПоказателейПланирования.Добавить();
		НоваяСтрока.ПараметрВыработки = ДопПараметры.ПараметрВыработки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		ТекущиеДанные.РазрезыПланирования = ?(ЗначениеЗаполнено(ТекущиеДанные.РазрезыПланирования),
			ТекущиеДанные.РазрезыПланирования + ", ", "")
			+ Строка(НоваяСтрока.РазрезПланирования) + 
			?(ЗначениеЗаполнено(НоваяСтрока.ВариантАналитики), " (" + НоваяСтрока.ВариантАналитики + ")", "");
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОперативноеПланированиеПриИзменении(Элемент)
	Элементы.ГруппаИспользоватьОперативноеПланирование.Видимость = Объект.ИспользоватьОперативноеПланирование;
	Элементы.НастройкиСозданияЗаказа.Видимость                   = Объект.ИспользоватьОперативноеПланирование;
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПланированияПараметрВыработкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоказателиПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СводныйПоказатель   = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекущиеДанные.ПараметрВыработки, "СводныйПоказатель");
	ТекущиеДанные.РазрезыПланирования = "";

КонецПроцедуры

&НаКлиенте
Процедура РазрезыПланированияРазрезПланированияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РазрезыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ВариантАналитики              = "";
	ТекущиеДанные.ПланированиеПоГруппам         = Ложь;
	
	Если ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики)
		И Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ОбъемыПеревозок") Тогда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.МодельТС");
	ИначеЕсли ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики) ТОгда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТС");
	ИначеЕсли ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Статья")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики) Тогда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.СтатьяДоходов");
	ИначеЕсли ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики) Тогда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Маршрут");
	ИначеЕсли ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики) Тогда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Заказчик");
	ИначеЕсли ПолучитьФункциональнуюОпциюЖД() И ТекущиеДанные.РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураГруза")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ВариантАналитики) Тогда
		ТекущиеДанные.ВариантАналитики   = ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Номенклатура");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВедущийСценарийПриИзменении(Элемент)
	
	ПериодичностьДолгосрочногоПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВедущийСценарий, "Периодичность");
	УстановитьСписокВыбораПериодичностьПланирования(ПериодичностьДолгосрочногоПланирования);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	флРазделПредоставленныеУслуги = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги");
	флРазделДоходыРасходы         = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ДоходыРасходы");
	флРазделОбъемыПеревозок       = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ОбъемыПеревозок");
	флРазделВыработка             = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Выработка");
	флРазделАренда                = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Аренда");
	флРазделРемонтыИТО            = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.РемонтыИТО");
	флРазделЗаказыНаЖДПеревозки   = Ложь;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ПолучитьФункциональнуюОпциюЖД() Тогда
		флРазделЗаказыНаЖДПеревозки = Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ЗаказыНаЖДПеревозки");
	КонецЕсли;
	
	Элементы.ПериодичностьКраткосрочногоПланирования.Видимость     = Объект.ИспользоватьКраткосрочноеПланирование;
	Элементы.ПолучательУслуг.Видимость                             = флРазделПредоставленныеУслуги;
	Элементы.ГруппаПолучательУслугВалюта.Видимость                 = флРазделПредоставленныеУслуги ИЛИ флРазделДоходыРасходы Или флРазделРемонтыИТО;
	Элементы.ВедущийСценарий.Видимость                             = Объект.ВидПланирования = ПредопределенноеЗначение("Перечисление.уатВидыПланирования.Краткосрочный");
	
	Элементы.ОтображениеПериода.Видимость                          = Объект.ИспользоватьКраткосрочноеПланирование;
	Элементы.ГруппаИспользоватьОперативноеПланирование.Видимость   = Объект.ИспользоватьОперативноеПланирование;
	Элементы.НастройкиСозданияЗаказа.Видимость                     = Объект.ИспользоватьОперативноеПланирование;
	
	Элементы.ГруппаИспользоватьОперативноеПланированиеНастройки.Видимость = НЕ флРазделОбъемыПеревозок И НЕ флРазделАренда И НЕ флРазделРемонтыИТО;
	Элементы.ГруппаПоказателиПланирования.Видимость                       = НЕ флРазделОбъемыПеревозок И НЕ флРазделАренда И НЕ флРазделРемонтыИТО;
	Элементы.ПараметрВыработки.Видимость                                  = флРазделОбъемыПеревозок;
	Элементы.ПланированиеОбъемовВПроцентах.Видимость                      = флРазделОбъемыПеревозок;
	
	Элементы.ПланированиеВДнях.Видимость                                  = флРазделАренда;
	
	Если Объект.ПериодичностьКраткосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		Элементы.ГруппаОтображатьПериод.Доступность = Ложь;
		ОтображениеПериода = 0;
		ОтображениеПериодаПриИзменении(Неопределено);
	Иначе
		Элементы.ГруппаОтображатьПериод.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя")
		ИЛИ Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		Элементы.ГруппаИспользоватьКраткосрочноеПланирование.Видимость = Ложь;
		Объект.ИспользоватьКраткосрочноеПланирование = Ложь;
	ИначеЕсли флРазделОбъемыПеревозок Тогда
		Элементы.ГруппаИспользоватьКраткосрочноеПланирование.Видимость = Ложь;
		Объект.ИспользоватьКраткосрочноеПланирование = Ложь;
	Иначе
		Элементы.ГруппаИспользоватьКраткосрочноеПланирование.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаПредупреждение1.Видимость = Ложь;
	
	Если флРазделЗаказыНаЖДПеревозки Тогда
		Элементы.ГруппаПредупреждение1.Видимость = Истина;
	КонецЕсли;
	
	Если флРазделПредоставленныеУслуги Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Колонна"", ""Подразделение"", ""Транспортное средство"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", ""Column"", ""Unit"", ""Vehicle"" - planning and fact collection are always carried out.'");
	ИначеЕсли флРазделВыработка Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Колонна"", ""Транспортное средство"", ""Параметр выработки"" - планирование и сбор факта производится всегда.'; en = 'According to the analysts: ""Organization"", ""Column"", ""Vehicle"", ""Production Parameter"" - planning and fact collection are always carried out.'");
	ИначеЕсли флРазделДоходыРасходы Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Колонна"", ""Подразделение"", ""Транспортное средство"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", ""Column"", ""Unit"", ""Vehicle"" - planning and fact collection are always carried out.'");
	ИначеЕсли флРазделОбъемыПеревозок Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Подразделение"", ""Перевозчик"", ""Договор"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", ""Division"", ""Carrier"", ""Contract"" - planning and fact collection are always carried out.'");
	ИначеЕсли флРазделАренда Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Транспортное средство"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", ""Vehicle"" - planning and fact-finding are always carried out.'");
	ИначеЕсли флРазделРемонтыИТО Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"", ""Транспортное средство"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", ""Vehicle"" - planning and fact-finding are always carried out.'");
	ИначеЕсли флРазделРемонтыИТО Тогда
		Элементы.ДекорацияОписание.Заголовок = 
			Нстр("ru = 'По аналитикам: ""Организация"" - планирование и сбор факта производится всегда.'; en = 'According to analysts: ""Organization"", - planning and fact-finding are always carried out.'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокВыбораПериодичностьКраткосрочногоПланирования()
	
	Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Очистить();
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.ПериодичностьКраткосрочногоПланирования.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокВыбораПериодичностьПланирования(ПериодичностьДолгосрочногоПланирования)
	
	Элементы.Периодичность.СписокВыбора.Очистить();
	
	Если ПериодичностьДолгосрочногоПланирования = Неопределено Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		
	ИначеЕсли ПериодичностьДолгосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли ПериодичностьДолгосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли ПериодичностьДолгосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли ПериодичностьДолгосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ИначеЕсли ПериодичностьДолгосрочногоПланирования = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
		Элементы.Периодичность.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораРазрезПланирования(Раздел)
	
	СписокВыбораРазрезПланирования = Новый СписокЗначений;
	
	ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС"));
		
	Если Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.РемонтыИТО") Тогда
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураТО"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Колонна"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Подразделение"));
	ИначеЕсли Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Аренда") Тогда
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Подразделение"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Договор"));
	Иначе
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ВидПеревозки"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ОбъектСтроительства"));
		ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
		ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НаправлениеПеревозки"));
		Если ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки") Тогда
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
				ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураГруза"));
		КонецЕсли;
		
		Если Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги")
			Или Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ДоходыРасходы")
			Или Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Выработка")
			Или Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ЗаказыНаЖДПеревозки") Тогда
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Подразделение"));
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ПараметрВыработки"));
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Колонна"));
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент"));
		КонецЕсли;
		
		Если Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
			
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Договор"));
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Услуга"));
			
		ИначеЕсли Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ДоходыРасходы") Тогда
			
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураГруза"));
			ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования,
			ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Статья"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВыбораРазрезПланирования;
	
КонецФункции

&НаСервере
Процедура ДобавитьВСписокВыбораРазрезаПланирования(СписокВыбораРазрезПланирования, Раздел)
	
	СтрокиРазделов = Объект.РазрезыПланирования.НайтиСтроки(Новый Структура("РазрезПланирования", Раздел));
	Если СтрокиРазделов.Количество() = 0 Тогда
		СписокВыбораРазрезПланирования.Добавить(Раздел);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПоказателейПланирования()
	
	Для Каждого ТекСтрока Из Объект.РазрезыПоказателейПланирования Цикл
		
		Разрез = ПоказателиПланирования.НайтиСтроки(Новый Структура("ПараметрВыработки",
		ТекСтрока.ПараметрВыработки));
		
		Если Разрез.Количество() <> 0 Тогда
			Разрез[0].РазрезыПланирования = ?(ЗначениеЗаполнено(Разрез[0].РазрезыПланирования),
			Разрез[0].РазрезыПланирования + ", ", "")
			+ Строка(ТекСтрока.РазрезПланирования) + 
			?(ЗначениеЗаполнено(ТекСтрока.ВариантАналитики), " (" + ТекСтрока.ВариантАналитики + ")", "");
		Иначе
			НоваяСтрока = ПоказателиПланирования.Добавить();
			НоваяСтрока.ПараметрВыработки   = ТекСтрока.ПараметрВыработки;
			НоваяСтрока.СводныйПоказатель   = ТекСтрока.ПараметрВыработки.СводныйПоказатель;
			НоваяСтрока.РазрезыПланирования = Строка(ТекСтрока.РазрезПланирования) + 
			?(ЗначениеЗаполнено(ТекСтрока.ВариантАналитики), " (" + ТекСтрока.ВариантАналитики + ")", "");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокРазрезов(РазрезПланирования)
	
	СписокВыбораВариантАналитики = Новый СписокЗначений();
	
	Если РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.ТС") Тогда
		Если Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ОбъемыПеревозок") Тогда
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТипТС"));
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.МодельТС"));
		ИначеЕсли Объект.Раздел = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.РемонтыИТО") Тогда
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТС"));
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.МодельТС"));
		Иначе
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТС"));
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ТипТС"));
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПринадлежностьТС"));
			СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.МодельТС"));
		КонецЕсли;
	ИначеЕсли РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Контрагент")
		И Объект.Раздел <> ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.Аренда") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Заказчик"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Грузоотправитель"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Грузополучатель"));
	ИначеЕсли РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Маршрут") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Маршрут"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПунктОтправления"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.ПунктНазначения"));
	ИначеЕсли РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.Статья") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.СтатьяДоходов"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.СтатьяРасходов"));
	ИначеЕсли ПолучитьФункциональнуюОпциюЖД() И РазрезПланирования = ПредопределенноеЗначение("Перечисление.уатРазрезыПланирования.НоменклатураГруза") Тогда
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.Номенклатура"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.КодЕТСНГ"));
		СписокВыбораВариантАналитики.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыАналитик.КодГНГ"));
	КонецЕсли;
	
	Возврат СписокВыбораВариантАналитики;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФункциональнуюОпциюЖД()
	
	Возврат ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки");
	
КонецФункции

#КонецОбласти
